marshallma21/AUTOSAR_SampleProject_MPC5748G/toolchains/Startup_vle.c
    ASM_KEYWORD(" .equ AIPS_B_PACRD, 0xF800010C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRD@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRD@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
/*    
    ASM_KEYWORD(" .equ AIPS_B_PACRE, 0xF8000110 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRE@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRE@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");        
*/
    ASM_KEYWORD(" .equ AIPS_B_PACRF, 0xF8000114 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRF@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRF@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_PACRG, 0xF8000118 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRG@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRG@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_PACRH, 0xF800011C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_PACRH@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_PACRH@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRA, 0xF8000140 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
  
    ASM_KEYWORD(" .equ AIPS_B_OPACRB, 0xF8000144 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRB@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRB@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRC, 0xF8000148 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRC@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRC@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRD, 0xF800014C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRD@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRD@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRE, 0xF8000150 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRE@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRE@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRF, 0xF8000154 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRF@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRF@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRG, 0xF8000158 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRG@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRG@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");    
 
    ASM_KEYWORD(" .equ AIPS_B_OPACRH, 0xF800015C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRH@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRH@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");    
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRI, 0xF8000160 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRI@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRI@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRJ, 0xF8000164 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRJ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRJ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
        
    ASM_KEYWORD(" .equ AIPS_B_OPACRK, 0xF8000168 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRK@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRK@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRL, 0xF800016C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRL@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRL@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");   
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRM, 0xF8000170 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRM@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRM@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRN, 0xF8000174 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRN@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRN@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRO, 0xF8000178 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRO@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRO@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRP, 0xF800017C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRP@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRP@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRQ, 0xF8000180 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRQ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRQ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");  
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRR, 0xF8000184 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRR@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRR@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRS, 0xF8000188 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRS@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRS@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRT, 0xF800018C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRT@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRT@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) "); 
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRU, 0xF8000190 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRU@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRU@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRV, 0xF8000194 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRV@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRV@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRW, 0xF8000198 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRW@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRW@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRX, 0xF800019C ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRX@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRX@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRY, 0xF80001A0 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRY@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRY@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
    ASM_KEYWORD(" .equ AIPS_B_OPACRZ, 0xF80001A4 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRZ@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRZ@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
  
    ASM_KEYWORD(" .equ AIPS_B_OPACRAA, 0xF80001A8 ");
    ASM_KEYWORD(" e_lis   r4, AIPS_B_OPACRAA@ha ");
    ASM_KEYWORD(" e_or2i  r4, AIPS_B_OPACRAA@l ");
    ASM_KEYWORD(" e_stw   r5, 0(r4) ");
    
