marshallma21/AUTOSAR_SampleProject_MPC5748G/toolchains/Startup_vle.c
    /* Configure Peripheral Space, cache-inhibit = TRUE */
    SMPU_1.RGD[1].WORD0.R = 0xF0000000;
    SMPU_1.RGD[1].WORD1.R = 0xFFFFFFFF;
    SMPU_1.RGD[1].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_1.RGD[1].WORD3.B.CI = 1;
    SMPU_1.RGD[1].WORD5.B.VLD = 1; 
    
    /* Configure CACHABLE_RAM regions */
    SMPU_1.RGD[2].WORD0.R = (uint32)(&__RAM_CACHEABLE_START);    
    SMPU_1.RGD[2].WORD1.R = (uint32)(&__RAM_CACHEABLE_END);
    SMPU_1.RGD[2].WORD2.FMT0.R = 0xFFFFFFFF;
    SMPU_1.RGD[2].WORD3.B.CI = 0;
    SMPU_1.RGD[2].WORD5.B.VLD = 1;
   
    /* Configure NO_CACHABLE RAM regions */
    SMPU_1.RGD[3].WORD0.R = (uint32)(&__RAM_NO_CACHEABLE_START);    
    SMPU_1.RGD[3].WORD1.R = (uint32)(&__RAM_NO_CACHEABLE_END);
    SMPU_1.RGD[3].WORD2.FMT0.R = 0xFFFFFFFF;
#ifdef D_CACHE_ENABLE    
    SMPU_1.RGD[3].WORD3.B.CI = 1;
#else
    SMPU_1.RGD[3].WORD3.B.CI = 0;
#endif 
    SMPU_1.RGD[3].WORD5.B.VLD = 1;
    
    /* Enable the module */
    SMPU_1.CES0.B.GVLD = 1;
#endif
/******************************************************************/
/* Freescale Guidance 4 - Set up INTC                             */
/******************************************************************/
    /* Configure INTC for hardware vector mode */
    S_REG_WRITE32(S_INTC_MCR,S_INTC_MCR_HVEN_ON|S_INTC_MCR_VTES_4BYTES);

    /* Setup main code priority */
    S_REG_WRITE32(S_INTC_CPR0,0);
    S_REG_WRITE32(S_INTC_CPR1,0);
#ifndef MPC5746C    
    S_REG_WRITE32(S_INTC_CPR2,0);
#endif    
   

/******************************************************************/
/* Call Main Routine                                              */
/******************************************************************/
    /* Prepare a terminating stack record. */
    ASM_KEYWORD (" e_li r0, -1");
    ASM_KEYWORD (" e_stwu r1, -8(r1)"); /* Decrement stack by 8 bytes, (write word) */
    ASM_KEYWORD (" e_stw  r0, 4(r1)");  /* Make an illegal return address of 0xFFFFFFFF */
    ASM_KEYWORD (" e_stw  r0, 0(r1)");  /* Make an illegal back chain address of 0xFFFFFFFF */

/******************************************************************/
/* Init runtime check data space                                  */
/******************************************************************/
#ifdef ENABLE_RCHECK
    /* initialization for the runtime checks memory space */
    init_runtime_check();
#endif /* ENABLE_RCHECK */


#ifdef MCAL_ENABLE_USER_MODE_SUPPORT
/******************************************************************/
/* Go to user mode and Call Main Routine                          */
/******************************************************************/
    Mcal_goToUser()
#endif /* MCAL_ENABLE_USER_MODE_SUPPORT */


    main();
    
    /* Define a symbol to Turn OFF (stop the tracing and save the data) the LTB PowerTracer */    
    ASM_KEYWORD(" .globl MCAL_LTB_TRACE_OFF");
    ASM_KEYWORD("MCAL_LTB_TRACE_OFF:");
    ASM_KEYWORD(" e_nop");
    
#ifdef CCOV_ENABLE
    /* code coverage is requested */
    ccov_main();
#endif
  
    ASM_KEYWORD ("se_illegal"); /* SW breakpoint to stop debugging */
     
    while (1)
    {
    }
   
}

/* This handler is the one that will be called after sc_se instruction. It is mapped to IVOR8 
The LR will be altered, at the end of the function. */

void SystemCall()
{
    ASM_KEYWORD(".globl SystemCall_Handler");  
    ASM_KEYWORD("SystemCall_Handler:");
#ifdef MCAL_ENABLE_USER_MODE_SUPPORT
    /* push R3 on stack*/
    ASM_KEYWORD("se_subi   r1,0x4");
    ASM_KEYWORD("e_stw     r3,0x0(r1)");
    /* clear MSR[PR] bit by modifying SRR1 for keeping supervisor mode after exiting the Handler */
    ASM_KEYWORD("mfsrr1      r3");                          /* load SRR1 */
    ASM_KEYWORD("se_bclri    r3,17");                     /* clear PR bit */
    ASM_KEYWORD("mtsrr1      r3 ");                        /* save SRR1 */
    /* pop R3 from the stack */
    ASM_KEYWORD("e_lwz     r3,0x0(r1)");
    ASM_KEYWORD("se_addi   r1,0x4");
    /* return from interrupt */
   ASM_KEYWORD("se_rfi");
#else
    /* while(1) */
     ASM_KEYWORD("e_b .");
#endif
}

/* if RUNTIME Checks are enabled (GHS toolchain) */
#ifdef ENABLE_RCHECK
int __re_extra, __re_pid;

#define AUX_BUFFER_SIZE 800
#define RUNTIME_COUNT_OF_VIOLATIONS 24

/* The "_rnerr" function will be called whenever a run-time error has occurred
 * and runtime error checking is enabled.  It will, in turn, call the handler 
 */
typedef struct
{
    uint32_t violation;   /**< violation code */
    uint32_t line_no;     /**< line number for the violation */
    sint8 filename[AUX_BUFFER_SIZE-RUNTIME_COUNT_OF_VIOLATIONS*4-4]; /**< filename. Length will be the min between 
                                                 space left in the data buffer and the current file name */
} Runtime_violation_info_t;

 typedef struct
{
    uint32_t runtime_check_count[RUNTIME_COUNT_OF_VIOLATIONS];      /**< count of all violations */
    uint32_t position;                     /**< position in data buffer */
    sint8 data[AUX_BUFFER_SIZE-RUNTIME_COUNT_OF_VIOLATIONS*4-4];  /**< data formatting - list of Runtime_violation_info_t 
                                              structures (filename length is variable) */
} Runtime_violation_t;
 
Runtime_violation_t *violation_storage;


void MyRuntimeErrorHandler(int code, int line, const char *filename) {
/*
 * code:       error type  
 * line:       line in the source code which fails  
 * filename:   name of the source file which fails  
 *          
 * Valid error types:  
 * 0:  UNUSED  
 * 1:  array index OutOfBounds
 * 2:  variant  
 * 3:  nil pointer  
 * 4:  switch out of bounds  
 * 5:  uninitialized variable  
 * 6:  assignment out of bounds  
 * 7:  division by zero  
 * 8:  value out of bounds (pred,succ)  
 * 9:  free of something not malloced  
 * 10: free of something already free  
 * 11: free list corrupted  
 * 12: reference to bad data  
 * 13: unreferenced memory  
 * 14: overflow  
 * 15: Error limit exceeded  
 * 16: Watchpoint  
 * 17: Return of nothing from non-void procedure  
 * 18: Ambiguous virtual function called  
 * 19: Attempt to free NULL  
 * 20: Heap max exceeded  
 * 21: Stack max exceeded    
 */
    uint32_t counter;
    uint32_t max_length;
    Runtime_violation_info_t *violation_data;

